<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>A gaming app that brings all your (GOG) games and friends in one place</string>
		<key>Identifier</key>
		<string>com.github.oliverweinm-recipes.download.GOGGalaxy</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>GOG Galaxy</string>
			<key>DOWNLOAD_URL</key>
			<string>http://content-system.gog.com/open_link/download?path=/open/galaxy/client/galaxy_client_2.0.23.3.pkg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<!-- URLDownloader -->
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.pkg</string>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: GOG Sp. z o.o. (9WS36Q8886)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
