<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Small but capable word processor</string>
		<key>Identifier</key>
		<string>com.github.oliverweinm-recipes.download.GrowlyWrite</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Growly Write</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<!-- URLText Searcher -->
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>href="(write_[\d]+\.dmg)"</string>
					<key>result_output_var_name</key>
					<string>filepath</string>
					<key>url</key>
					<string>https://www.growlybird.com/downloads/</string>
					<string>%SEARCH_PATTERN%</string>
					<key>url</key>
					<string>%SEARCH_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<!-- URLDownloader -->
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>https://www.growlybird.com/downloads/%filepath%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>requirement</key>
					<string>anchor apple generic and identifier "com.growlybird.write" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = M58SCVXVJ9)</string>
					<key>input_path</key>
					<string>%pathname%/Growly Write.app</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
