<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>An app that allows you to easily install and use numerous games and software designed to work on Microsoft Windows</string>
		<key>Identifier</key>
		<string>com.github.oliverweinm-recipes.download.PlayOnMac</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>PlayOnMac</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>href="https://repository\.playonmac\.com/PlayOnMac/PlayOnMac_([\d\.]+)\.dmg"</string>
					<key>result_output_var_name</key>
					<string>version</string>
					<key>url</key>
					<string>https://www.playonmac.com/en/download.html</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<!-- URLDownloader -->
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%-%version%.dmg</string>
					<key>url</key>
					<string>http://repository.playonmac.com/PlayOnMac/PlayOnMac_%version%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>requirement</key>
					<string>identifier "org.playonmac.playonmac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MK2RQZD575</string>
					<key>input_path</key>
					<string>%pathname%/PlayOnMac.app</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
