<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>An app that allows you to easily install and use numerous games and software designed to work on Microsoft Windows</string>
		<key>Identifier</key>
		<string>com.github.oliverweinm-recipes.download.PlayOnMac</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>PlayOnMac</string>
			<key>DOWNLOAD_URL</key>
			<string>http://repository.playonmac.com/PlayOnMac/PlayOnMac_4.4.1.dmg</string>
			<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        	<string>True</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<!-- URLDownloader -->
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<!-- CodeSignatureVerifier
			    Deactivated, as CodeSignatureVerifier fails for an unknown reason -->
			<dict>
				<key>Arguments</key>
				<dict>
					<key>requirement</key>
					<array>
						<string>identifier "org.playonmac.playonmac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MK2RQZD575</string>
					</array>
					<key>input_path</key>
					<string>%pathname%/PlayOnMac.app</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
