<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, unzips and verifies the installer app for the latest version of OverSight by Objective-See.</string>
    <key>Identifier</key>
    <string>com.github.oliverweinm-recipes.download.OverSight</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OverSight</string>
        <key>GITHUB_REPO</key>
        <string>objective-see/OverSight</string>
        <key>INCLUDE_PRERELEASES</key>
        <string>False</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
              <key>include_prereleases</key>
              <string>%INCLUDE_PRERELEASES%</string>
              <key>github_repo</key>
              <string>%GITHUB_REPO%</string>
              <key>asset_regex</key>
              <string>OverSight_[\d+?]{1,}.|_[\d+?]{1,}.|_[\d+?]{1,}.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME% Installer.app</string>
            <key>requirement</key>
            <string>anchor apple generic and identifier "com.objective-see.oversight.installer" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VBG97UB4TA)</string>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>