<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, unzips, verifies, packages and imports the installer of the latest version of RansomWhere by Objective-See into munki.</string> 
    <key>Identifier</key>
    <string>com.github.oliverweinm-recipes.munki.RansomWhere</string>
    <key>ParentRecipe</key>
    <string>com.github.oliverweinm-recipes.pkg.RansomWhere</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Objective-See</string>
        <key>DISPLAY_NAME</key>
        <string>%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Continually monitors the file-system for the creation of encrypted files by suspicious processes (i.e. ransomware).</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>postinstall_script</key>
            <string>#!/bin/sh
sudo /Applications/%NAME%_Installer.app/Contents/MacOS/%NAME%_Installer -install
rm -rf /Applications/%NAME%_Installer.app/
exit 0
            </string>
            <key>preuninstall_script</key>
            <string>#!/bin/sh
//stop launch daemon
sudo launchctl unload /Library/LaunchDaemons/com.objective-see.ransomwhere.plist

//remove launch daemon, its plist, and supporting files
sudo rm -rf /Library/LaunchDaemons/com.objective-see.ransomwhere.plist

sudo rm -rf /Library/Objective-See/RansomWhere
exit 0
            </string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_Installer-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>