<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Task Explorer by Objective-See.</string>
    <key>Identifier</key>
    <string>com.github.oliverweinm-recipes.download.TaskExplorer</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TaskExplorer</string>
        <key>REGEX_URL</key>
        <string>https://objective-see.com/products/taskexplorer.html</string>
        <key>REGEX</key>
        <string>href="(https:\/\/bitbucket\.org\/objective-see\/deploy\/downloads\/TaskExplorer_.*\.zip)"</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>%REGEX%</string>
                <key>url</key>
                <string>%REGEX_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>